[{"id":"email-help","key":"email-help","tags":["--no-show","帮助"],"title":"邮箱帮助","date":"2025-05-07T00:00:00.000Z","content":"# 邮箱帮助\n\n注册了qq账号就会附带一个qq邮箱, 邮箱名为`{你的qq号}@qq.com`, 手机端需要单独的`qq邮箱`软件, 或者网页端qq邮箱都可以使用","owner":"zhizhizhiwang"},{"id":"ggz","key":"ggz","tags":["人物传记","文章"],"title":"顾公传","date":"2025-6-19/16:11","content":"### 顾公传\n\n顾恒舟，字公公，世居上海。诞膺辰宿，动禀岐嶷。龆龀诵《龙族》，洞微若泻；总角开三石劲弓，贯虱如闲。眸含星斗，澄似寒潭；骨峙霜崖，峻同孤嶂。闾阎观者拊掌“骐骥伏枥，终跃渥洼；鲲鹏息翼，将图南冥！”\n\n及冠，身长八尺，岩岩若松立器宇轩昂，凛凛如月悬。文能安天下，墨洒江海沸，赋成而洛神惊。其文烛出隐若犀照，焕云霞夺天工。著《蹴鞠赋》，气吞八荒，席卷宇内。武可定乾坤，剑啸则黄河动，锋指则胡骑摧。青冥出匣，杀气冲霄，白虹裂云。尝单骑而叩北塞，枭首攫纛，虏魄丧于旌旆；踏阵摧锋，朔风扬其鼓角。或云：“文超葛谢，藻耀长河悬丽日；武及韩白，勋高泰岳镇坤维。”真天授英华，地钟灵粹者也。\n\n时邵州邵王叛，顾公佐天子于八宝，拯黔首于涂炭。于大泽乡一战。时朔风折，铁甲凝冰，鼓震霄裂胆，火焚辎重烛霄。箭蝗蔽野，戈林排云。溃若山颓岳坼，自蹂成血沼；流如川决泽漫，几欲漂橹浮。此之战也，邵王裂帛请降，童竖指碑啜泣。\n\n海内初靖，公转治民稷。持身玉壶冰澈，御下春阳和煦。越明年，太仓粟溢，闾阎颂沸。尝植桐于庭，翠盖欲招彩凤。曰：“待此亭也，清阴以待休明。”其志洁霜雪，心涵霖雨，昭然可见。\n\n庆历十五年春，星垂野阔，月涌江流，公复入池，暝目追往，塞上笳咽犹耳，灯前墨香在衿。是时也，万籁寂，惟水佩清鸣；四顾清，独星月交辉。然而暖涓若露沾茎，拂拭未已，赤泉迸地，殷透清波。公心骇欲呼，然气窒力绵，喉暗若冰。遂溢焉长往。\n\n郝公曰：顾公文武双全，别业赫赫。然沧溟扬尘，英雄同烬，代有其人。惟此荒诞一殂，青史添异色，千秋付樵讴。龙渊断千钧，崩于砥石；天驷驰万里，蹶于蚁穴！噫！于公之身，昭昭明矣。","owner":"李子琪"},{"id":"hu-gong-zhuan","key":"hu-gong-zhuan","tags":["人物传记","文章"],"title":"胡公传","date":"2025-04-29T00:00:00.000Z","content":"# 胡公传   \n胡公，字彦辰，自上海徐汇人也。胡少骁武，善骑射，至性贞悫，机鉴敏悟。自幼好学，善属文，举七宝中学，授一十九号之职。邵亚王引为左右，累迁二十号。   \n\n胡长遂博览群书，不事章句之学，而爱奇尚异，深沉有远识，尝记序，其言曰：“人非善不交，物非义不取，于兄弟肸肸，于朋友怡怡。”    \n\n期一年，众人得其所好，竞为制砚。吾观其室，已有砚八十有八，间一出之，置几上，兀傲相对。尝游儿宝间，遇人授古制砚法，因曰：“造古法砚”。躬操绳墨，虽龟手黧面形貌奇古。其砚庄重而威严，有其价然无市也。 \n\n偶得一石于七宝中学中，吾赠予胡公，其歙石也，当是时也，邵王喜怒无常，而天渐寒，砚冰坚，工此石也，难于上青天。胡公朝侍邵王，午精其学，夜色渐晚，终有余而工其石。夜以继日，三旬有余，善矣。其砚方正，莲荷伸之，游鱼若干，栩栩若为生也。其上有字，曰：“平民本色，精英气质。”上闻之，欲召为大太监，胡公不愿与世而争，辞不赴命。胡公之技，愈加精练。有言曰：“及胡砚成，祥云千里，百鸟争鸣。”其赠一予吾，椟藏之，日以泉水洗之。 \n\n明年，邵王薨，有乱臣贼子企谋王位，胡公私谋之。待其计成，作檄文告召天下。珠连者百余人，揭杆为旗，欲攻之为王。胡曰：“区区数百敌军，看我一击灭之！”被甲携枚，如入无人之境，尽数灭之，号百人斩。\n\n其势渐大，大旱之年，放粮遗百姓，民多从之。上恐，欲杀之，群臣皆异，沮之。连年大旱，民皆易子而食，又逢瘟疫、伏尸千里，胡公使发米粥，符水。从者无数，头带黄巾。 \n\n期一年，胡公以上不恤民情, 卒数万之师，号曰：“方士胡公，请王朝赴死！”天下云集响应，胡公以砚为信物，每破一城而置一砚从作记。时二年，克之，即位，改国号彦斌，轻徭役赋税，休养生息。越明年,百废俱兴。    \n\n彦斌十五年，胡太祖改国号天宝，欲其娱也，食前方丈不为奢，歌舞靡曼不为淫，弋猎驰骋不为荒，珍禽奇玩充斥亭馆，设立东宫以寻天下窈窕，日夜旌歌，竟有三年拒不上朝。外有敌患之忧，内有叛乱之祸，吾上书数，不闻。    \n\n明年，人皆讨之，胡公以兵镇之。五月，胡公自知身愈空虚，躬亲炼丹以谋长生。六月，丹成，天阵异象，雪飘三日。或曰，此丹可逆活一世，从之始也。故称始丹。    \n\n胡公大喜，大赦天下，延三日，服之，卒。人或异之：“其行道而长仙也。”吾寻之未果，特意此传记之。","owner":"李子琪"},{"id":"jjx","key":"jjx","tags":["人物传记","文章"],"title":"金俊熹传","date":"2025-5-19","content":"### 金俊熹传\r\n金俊熹，陕西西安人者也。年幼自好学，习吉他，冬夏不怠，周而复始，鲜顾皲裂，成厚茧于指腹，其勤奋如此，不必表而见也。师欣于其颖，荐至宫廷，乡亟振鼓兴贺，谓曰“天临福禄于此，吾等自当涕零”。\r\n\r\n及六岁，入学堂，称“西工大附小”。其才初见，为学则智解，为体则敏捷。师皆信其为“天资聪慧，非常人之所能及”。俊熹自幼常诵古诗，体悟历史之道，虽小儿天真，却解前人忧国忧民之思愁，喻之于怀。适校飞花令之赛，遂得巅峰之名。当此之时，妙口珠舌，唇齿伶俐，古语之流，如若激湍，引人惊叹：“此小儿绝非平常人也！”。又善体育，花绳翻飞，一举夺魁；蹴鞠场上，疾迅如兔。此可谓全面发展而又人文见长也矣！\r\n\r\n舞勺之年，至西工大附中，逢化学，遽乐于此。原子之变，物质相化，继而成山河。遂感人之渺小，宇宙宏大，终得“何为天地玄黄，宇宙洪荒”。废寝忘食，常破晓而入眠，其为学之道、为学之姿，颇类范文正公之划粥割齑。其识愈丰富，拜师清华，精进化学，而有“学士”之称。后中考，科术九门，仅失二十有四。\r\n\r\n于学堂，常捉弄同窗。藏匿其书笔纸砚，并以此为乐。若遇人愠怒，则状作无辜以取人之同情。此可谓金俊熹之求生之道也。故同学均与之交善，有“五人帮”者，乃俊熹之生死之交也。其五人均身世显赫，出类拔萃，有深究理学之属，又有精通异语之才。此五人相协互助，世无能与之抗衡之团。尝与亢氏交好，相恋五年，不幸分隔两地，终裂于二四除夕，先于欢乐曲《难忘今宵》半香前。后遇余氏，相爱至今。\r\n所谓“读万卷书，行万里路”。每逢节假，必出国门以体会异域风情。多之大和，又至迪拜，见密林沙海，白雪之山。又置身当地民生，遥想昔日古文之诵，故知“先天下之忧而忧”者感人宏伟之言。\r\n\r\n俊熹遂望风起事，救平民于水火之中。联钢铁侠，双剑合璧，兵起东南之地，一路制弊而歼灭资本之伦，攻至京城，终灭前世之余威。后称王，使臣作此篇，以述己功成名就之生。\r\n\r\n噫！文理兼修，此之为“立己”；推才于国，此之为“达人”。立己达人，此之谓高尚士也。","owner":"Quantum Genetics"},{"id":"qbvisualnovel","key":"qbvisualnovel","tags":["--no-show"],"title":"红五月社团发言暨七色齿轮物语","date":"2025-05-31:18:45","content":"先简单介绍一下\n这个视频的构思, \n~~比如你们运用了什么样的技术, ~~\n~~然后你们在内部是几个社团进行了怎样的分工, ~~\n你们为什么想要去为七中制作这样一个动画视频, \n过程中遇到了什么困难是怎么克服的？比如说修改了好几稿, \n\n最后可以落到希望能够用动画的形式是为大家定格关于七中的记忆之类的。\n\n## 构思\n\n以七宝中学校园为背景, 构建符合狂欢节氛围的轻小说故事.\n简化交互形式, 让同学可以线上参与 --> 做成动画\n\n## 运用了什么技术\n\n(github) + (cloudflare)网站  (活动展示)\nOpenWebGal (游戏互动主体)\n\n## 社团分工\n|社团|分工|\n|-|-|\n|推理社|故事撰写|\n|电视台|宣传片辅助|\n|程序设计社|宣传片, 网站|\n|红石社|场景搭建, 录制, 网站|\n## 为什么\n\n为七中:\n红石社长期制作的学校模型得以呈现,\n场景熟悉, 打破固有印象\n通过虚构的故事展现校园的另一种形象~~(虚构叙事)~~\n\n\n创新, 增加狂欢节的乐趣\n拓展互动形式\n做成动画+线上的形式主要是为了可以使用手机直接参与, 能够让想参与到里面的人数方便, 自由\n\n## 困难\n**西阶梯没网** --> 实操上出了一点问题\n\n前期筹划, 组织, 动员社员\n故事稿: 对主题的契合, 交互形式的优化\n网站: \n+ 学习新技术\n+ 多人协作\n+ 交互的数据传输\n视觉小说:\n+ **人力**\n+ 多人协同\n\n宣传片:\n+ 如何视听结合, 配合好叙事节奏将内容呈现出来\n+ 素材制作\n\n## 合作\n社团课组织开展活动\n老师提出修改意见\n\n## 升华主题\n\n\n## 正文\n\n各位老师, 同学大家好。我是红石设计社社长王行知, 作为狂欢节《故事实验室》活动的主要策划。很高兴能够在这里向大家分享我们的创作经历。\n我们活动的主要内容是在线的互动视觉小说, 彼时同学们可以在网站上投票共同决定故事的走向与发展, 寻背后故事真相。\n作为活动中的精髓剧本\"七色齿轮物语\", 先由我完成了故事大纲并社团联通过了审核, 再由推理社的社长和副社长负责完成了对小说完整剧本的编写。\n我们希望能够以一个契合狂欢节氛围的轻小说, 带给大家轻松愉快的游戏体验。\n在故事中, 我们选择了七中校园作为故事的展开场景。原因其一为七中校园作为大家熟悉的场景, 可以通过虚构的故事为大家带来新的体验与感受, 其二是红石设计社完成了学校整体的模型搭建, 也方便后续的场景拍摄。\n为了完成视觉小说的主体, 我们选择了`OpenWebGal`作为制作引擎, 根据完成的小说内容对话, 由红石社的成员们在地图中进行相应场景改建, 拍摄故事场景演绎并制作对话进行脚本。\n在狂欢节前的几节社团课中, 我们完成了引擎使用与场景拍摄的教学, 并以章节为单位, 由社员分工完成了整体游戏制作, 整合后作为活动的主要呈现方式展出。\n作为所需的时间和人力最大的环节, 社团成员尽心尽力, 最终在社团老师的组织帮助下按时完成了全部任务。\n而为了让狂欢节的大家都可以参与到我们的活动中, 我们共同制作了在线网站用于展示和投票。\n对于首次尝试前端开发的我们遇到了不少困难, 但是在程序设计社和电视台成员的帮助下, 最终完成了网站的主体搭建与功能实现。\n通过将故事的交互形式限定在选项, 可以让同学们仅通过手机就能参与到活动中, 拓宽了活动的参与方式与方法。即使最终受制于现实条件, 我们仍尽力让每个人都可以参与到游活动的进程中。\n在狂欢节展开关于七中校园的冒险故事, 希望能够为大家留下关于七中校园的独特记忆, 也是为我们的高中生话添上特别的一笔。\n\n### 正文(AIGC)\n\n尊敬的各位老师、亲爱的同学们：\n\n大家好！我是红石设计社社长王行知, 也是本次狂欢节《故事实验室》活动的主要策划。今天非常荣幸能在这里与大家分享我们的创作历程。\n\n本次活动以线上互动视觉小说为核心形式, 参与者可以通过线上网站投票共同决定故事走向, 在互动体验中探寻事件背后的真相。同时我们也在西阶梯进行了线下直播, 布置了相关小游戏提供给大家游玩。\n作为活动亮点, \"七色齿轮物语\"剧本由我负责故事框架设计, 经社团联审核通过后, 由推理社社长及副社长共同完成全剧本创作。\n我们希望这部充满狂欢节氛围的轻小说作品, 能为同学们带来轻松愉悦的互动体验。\n\n在场景设定上, 我们选择了七中校园作为故事舞台, 一方面, 熟悉的场景能让读者在虚构故事中获得新颖的代入感; \n另一方面, 得益于红石设计社已完成的全校模型搭建, 为后续场景拍摄提供了相当便利。\n\n技术实现方面, 我们选用OpenWebGal作为开发引擎。红石社成员们根据剧本内容, 在虚拟校园中进行场景改造、角色演绎拍摄及对话脚本制作。\n在狂欢节前的社团课程中, 我们完成了技术培训, 并按照章节进行分工, 最终在社团老师的协调帮助下顺利完成全部内容整合。\n\n为提升活动参与度, 我们开发了线上投票平台。虽然作为全栈开发的新手, 我们面临诸多挑战, 但在程序设计社和电视台成员的协助下, 最终实现了网站的全部功能。\n通过简化为选项交互的设计, 确保同学们仅需手机即可参与, 为活动提供了不同的参与形式。\n\n这场发生在七中校园的奇幻冒险, 不仅希望能为同学们留下独特的青春记忆, 更愿成为点缀我们高中生活的璀璨一笔。感谢所有参与者的支持与付出！","owner":"zhizhizhiwang"},{"id":"shen-gong-lu","key":"shen-gong-lu","tags":["人物传记","文章"],"title":"神公录","date":"2025-5-26-12:48","content":"### 神公录\r\n        \r\n神公出佘山嶻嶭之外，紫炁裾衣为景云之袍，乘龙关外而翥于鹓雏之霄。垠漠瞢暗曀霾蔽之无迹，辄援笔为记之而怀其尊容，冀神公感而摅玄珠、入木之谕，锡嘏于黔黎，俾兆民咸仰。\r\n\r\n神公，申沪黄浦人也。纳命天时，苍昊流虹，缇霞氤氲，三日不晞。乡闾竦叹，谓之垂世虹女。戊子季春，父贺其弥月，为饰簪鬘，璚瑶焜燿，若掇星汉之精，涵沐羲和之曜。有孺子三岁，见之辄稽首伏拜，曰：“虹明神女临凡！”门庭阗骈，踵武相接。未几，名闻八纮，或讹为“鸿蒙神女”。都下有耆老，期颐去一，矻矻问仙，闻之遂负笈往谒，图长生之诀。既见，神公与之谈玄竟日，俄有鹤衔符而至，引其神游阊阖。返则谓人曰：“睹虹明境，遂廓然忘尘。”未逾晷刻，溘然长往。好事者传诸四方，众以为怪，遂渐无问津者。\r\n\r\n既之豆蔻，神女行若轻云蔽月，止如澧兰被露，周身若有昳光蓊葧。入立达，行采异于常人，咸号神公。立达数有异士，尤与神公善者，莫若袁公。其身逾六尺，貌体颀长。众后集曰“立达众”，容后再叙。年方十五，入列仙班十二，属“七宝宫”。习术日间，与顾氏并熹氏为友。神公长造物之术，尝与沈氏、廖氏共修此法，后通明。\r\n\r\n当是时，申沪大旱，赤熛肆虐，土膏坼裂，槁禾盈野，民有菜色。神公怛然伤怀，每至丙夜，蹑紫炁陟东山之崿，振云而舞，虹光上薄，穹昊晔晔。俄顷有丰隆作响，屏翳布津，甘霖霶霈，沾濡四隰，使枯木生荑。乡异而私谓曰：“此非曩时虹明神女乎？”然里中少年昧，疑为魑妖，聚爇艾萧，将焚其庐。神公喟叹，乘虹遄征，使家户有米，遗金簪于村井，遂冽若玉醴，饮之疴疢皆瘳。\r\n\r\n越明年，海隅有巨虾，鼓浪孽涛，波若山峙，覆舟如芥，渔户惶骇。神公并立达众忽临潮涘，被霞帔，曳华裾，秉玉柄麈尾，召命百灵。但见沧溟之中，赤螭蜿蜒，金鳞炳焕，与虾鬬于阳侯之波。三日三夜，虾不胜，逋逃至穷发之北，溺毙于溟。沿海士民感德，欲营祠庙以祀，神公却之曰：“吾本乘炁而行，非觊人间粢盛也。”言讫，履浪而西，其后海蜃昽昽，七彩焜煌，经月不昧。众人皆呼：“善哉乎神公！”\r\n\r\n既而天下板荡，干戈倥偬，黎元流离，暴骨盈野。神公遁迹太荒之崿，结茨为宇，采松腴为粮。每眺人间烽火，辄泫然流涕，以玉盏承沆瀣，和以灵蕤，化甘霖以赈饥溺。然世人但知天眷，莫识神公之赐。一日，有樵者入山，见其庐中悬玉版，隐约可辨“劫尽当还”四字。归而语人，寻有猎奇者金氏循踪往访，至则庐已空寂，唯余虹光盈地，倏瞬幻灭，莫可追蹑。后金氏曰：“神公倩而魅于佘山，自无影也！”\r\n\r\n嗟乎！夫神公之迹，大象无形，大音希声，来无朕兆，去绝行迹，若飙若雹。其心则恫瘝在抱，其行则弘济寰区，而世弗能知，人弗能名。今者佘山岑寂，紫炁销沉，唯余故井金簪，仓廪实犹而映蟾辉。愿后之览者，睹斯异迹而缅神公之懿德，庶几承其遗志，怀仁怛于天下，则神公虽隐，亦若昭昭不匮也。","owner":"勾勾叉"},{"id":"test","key":"test","tags":["单元测试"],"title":"markdown单元测试","date":"2025-4-30","content":"# Welcome to Qbbs! 欢迎来到Qbbs!\n \n## 1. 排版\n \n**粗体** *斜体* \n \n~~这是一段错误的文本。~~\n \n引用:\n \n> 引用\n \n有充列表:\n 1. 支持Vim\n 2. 支持Emacs\n \n无序列表:\n \n - 项目1\n - 项目2\n \n \n## 2. 图片与链接\n \n图片:\n![qbbs](http://blog.redstonehub.top/qbbs.png)\n链接:\n \n[这是去Qbbs的链接](http://blog.redstonehub.top)\n \n## 3. 标题\n \n以下是各级标题, 最多支持5级标题\n \n\n# h1\n## h2\n### h3\n#### h4\n##### h4\n###### h5\n\n \n## 4. 代码\n \n示例:\n \n    function get(key) {\n        return m[key];\n    }\n    \n代码高亮示例:\n \n``` javascript\n/**\n* nth element in the fibonacci series.\n* @param n >= 0\n* @return the nth element, >= 0.\n*/\nfunction fib(n) {\n  var a = 1, b = 1;\n  var tmp;\n  while (--n >= 0) {\n    tmp = a;\n    a += b;\n    b = tmp;\n  }\n  return a;\n}\n \ndocument.write(fib(10));\n```\n \n```python\nclass Employee:\n   empCount = 0\n \n   def __init__(self, name, salary):\n        self.name = name\n        self.salary = salary\n        Employee.empCount += 1\n```\n \n# 5. Markdown\n \nMarkdown 支持:\n \n* 表格\n* 定义型列表\n* Html 标签\n* 脚注\n* MathJax 公式\n \n## 5.1 表格\n \nItem     | Value\n-------- | ---\nComputer | \\$1600\nPhone    | \\$12\nPipe     | \\$1\n \n可以指定对齐方式, 如Item列左对齐, Value列右对齐, Qty列居中对齐\n \n| Item     | Value | Qty   |\n| :------- | ----: | :---: |\n| Computer | \\$1600 |  5    |\n| Phone    | \\$12   |  12   |\n| Pipe     | \\$1    |  234  |\n \n \n## 5.2 定义型列表\n \n名词 1\n:   定义 1（左侧有一个可见的冒号和四个不可见的空格）\n \n代码块 2\n:   这是代码块的定义（左侧有一个可见的冒号和四个不可见的空格）\n \n        代码块（左侧有八个不可见的空格）\n \n## 5.3 Html 标签\n \n支持在 Markdown 语法中嵌套 Html 标签，譬如，你可以用 Html 写一个纵跨两行的表格：\n \n    <table>\n        <tr>\n            <th rowspan=\"2\">值班人员</th>\n            <th>星期一</th>\n            <th>星期二</th>\n            <th>星期三</th>\n        </tr>\n        <tr>\n            <td>李强</td>\n            <td>张明</td>\n            <td>王平</td>\n        </tr>\n    </table>\n \n \n<table>\n    <tr>\n        <th rowspan=\"2\">值班人员</th>\n        <th>星期一</th>\n        <th>星期二</th>\n        <th>星期三</th>\n    </tr>\n    <tr>\n        <td>李强</td>\n        <td>张明</td>\n        <td>王平</td>\n    </tr>\n</table>\n \n**提示**, 如果想对图片的宽度和高度进行控制, 你也可以通过img标签, 如:\n \n<img src=\"http://blog.redstonehub.top/qbbs.png\" width=\"50px\" />\n \n## 5.4 脚注\n \nQb bbs[^footnote]来创建一个脚注\n  [^footnote]: 脚注\n \n## 5.7 MathJax 公式\n \n`$` 表示行内公式： \n \n质能守恒方程可以用一个很简洁的方程式 $ E=mc^2 $ 来表达。\n \n`$$` 表示整行公式：\n \n$$  \n \\sum_{i=1}^n a_i=0  \n$$   \n \n$$\nf(x_1,x_x,\\ldots,x_n) = x_1^2 + x_2^2 + \\cdots + x_n^2  \n$$\n更复杂的公式:  \n\n$$  \n\\begin{eqnarray}\n\\vec\\nabla \\times (\\vec\\nabla f) & = & 0  \\cdots\\cdots梯度场必是无旋场\\\\\n\\vec\\nabla \\cdot(\\vec\\nabla \\times \\vec F) & = & 0\\cdots\\cdots旋度场必是无散场\\\\\n\\vec\\nabla \\cdot (\\vec\\nabla f) & = & {\\vec\\nabla}^2f\\\\\n\\vec\\nabla \\times(\\vec\\nabla \\times \\vec F) & = & \\vec\\nabla(\\vec\\nabla \\cdot \\vec F) - {\\vec\\nabla}^2 \\vec F\\\\\n\\end{eqnarray}\n$$","owner":"zhizhizhiwang"},{"id":"wanggg","key":"wanggg","tags":["人物传记","文章"],"title":"汪公公传","date":"2025-5-7-12:45","content":"# 汪公公传\r\n\r\n汪信宇，字欣宇，淮阴人也。祖大猷以武举授千户。汪五岁能骑马射雀，七岁随父猎虎，引角弓贯其双目，惊为小飞将。\r\n\r\n九岁，有大虫袭，汪徒捕之，然势断，血染白袍。自称汪公公也。偶得一奇书，名曰“阴柔剑法”，汪公习之五年，大成，寒光凛凛，落叶纷飞而不可近三尺。\r\n\r\n加冠之年，其父大功在身，为上所忌，以计杀之。汪公晓之，练兵如常，暗中操练亲兵，谋定而动。明年，上使攻敌，直来发从军，率\r\n百人直驱敌营，夜时冰霜结铠而返，御史叹曰：“汪将有卫霍之风，然鹰视狼顾，不可久居人下矣！”\r\n\r\n八年，借剿邪教聚兵三万，于宣府暗藏兵甲。是年大旱，民不聊生, 朱门酒肉臭，路有饿死骨。是年未，伪作檄文，一呼而百应。乃夜袭函关，三路奇袭，左率牛车负柴草焚关楼，右率兵作流民夺吊桥，\r\n亲率铁骑正面攻城，克之。适逢臣谋父者居此，汪公持长剑，碎首三百余，史载“秦淮水赤，栖鸦街骨。”\r\n\r\n破关后星夜疾驰，轻骑达朝外，\r\n禁军降，上遁。于是登基为帝，改国号性欲，娶张宰相一女为皇后。晓谕天下。\r\n\r\n一日畋，遇一虎，见其毛鬓皆白, 称奇, 驯之. 自此白虎常伴左右, 夜卧龙榻之侧，朝伏御座之下。每有决断，虎啸则允，虎默则否，民间遂传\"政令半出虎口。\"\r\n\r\n三载，渐生骄奢，于骊山筑摘星台，高一一四丈，饰以南海明珠，台内置遍香池，昼夜笙歌不绝，旁建白虎芜，日以活羊饲之，有谏臣上《九思疏》，汪公怒，使虎噬其臂。\r\n\r\n天怒人怨，幽州司马陈借白虎凶兆聚兵。是夜，陈率玄甲军破潼关，关中二郡望风而降。汪公急召禁军，然多年未练，甲胄生蛆，弓弦朽断。\r\n\r\n城破之际，汪公披发跣足，左抚虎须，右揽其妻，骑虎北下，持剑杀出,踏月而去。\r\n\r\n归隐数载，居山林中，从芦苇为屋，采菱藕为食。当年白虎以老，犹能搏杀野猪。时或见，白发老翁练其剑。虎卧树下观之，爪印入石三分\r\n\r\n三年，吾独访之，汪公身形皆消瘦，将其迹告之，愿撰之为记，允之。三月，吾再访其舍，己去，空屋破榻，无人烟矣。","owner":"李子琪"}]